espressif2022/esp_emote_gfx/test_apps/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FREERTOS_HZ=1000
CONFIG_GFX_FONT_FREETYPE_SUPPORT=y
CONFIG_GFX_EAF_HEATSHRINK_SUPPORT=y
CONFIG_GFX_BLEND_POLYGON_MAX_INTERSECTIONS=32
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y
CONFIG_MMAP_FILE_NAME_LENGTH=32
CONFIG_LV_FONT_FMT_TXT_LARGE=y
